app/controllers/grabs_controller.rb

INSERT INTO `grabs` (`created_at`, `updated_at`, `user_id`, `item_id`) VALUES('2010-08-24 04:46:25', '2010-08-24 04:46:25', 1, 1)
---
  def create
    @grab = Grab.new(params[:grab])
    if @grab.save