app/controllers/invitations_controller.rb

INSERT INTO `invitations` (`created_at`, `recipient_email`, `token`, `updated_at`, `sent_at`, `sender_id`) VALUES('2010-08-19 21:34:22', 'foo@example.com', '0738119c15672940b69c76f5d19d24c9dc80d329', '2010-08-19 21:34:22', NULL, NULL)
---
  def create
    @invitation = Invitation.new(params[:invitation])
    @invitation.sender = current_user
    if @invitation.save