app/controllers/items_controller.rb

  def index
    @items = Item.all # show all items
---
SELECT * FROM `items`

  def show
    @item = Item.find_by_id(params[:id]) #find the particular item
---
SELECT * FROM `items` WHERE (`items`.`id` = '1') LIMIT 1