app/controllers/relationships_controller.rb

  def create
    @relationship = current_user.relationships.build(:relation_id => params[:relation_id])
    if @relationship.save
---
INSERT INTO `relationships` (`created_at`, `followed_id`, `updated_at`, `follower_id`) VALUES('2010-08-24 01:45:46', 2, '2010-08-24 01:45:46', 1)

  def destroy
    @friendship = current_user.relationships.find(params[:id])
    @friendship.destroy
---
SELECT * FROM `relationships` WHERE (`relationships`.`id` = 1 AND (`relationships`.user_id = 1))
DELETE FROM `relationships` WHERE `id` = 1