app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
  def show
    @user = User.find(params[:id])