app/controllers/users_controller.rb

  def show
    @user = User.find_by_login(params[:username])
    @items = @user.items
    @activities = @user.activities.paginate :page => params[:page], :per_page => 15, :order => 'created_at DESC'
---
SELECT * FROM `users` WHERE (`users`.`login` = 'kyle') LIMIT 1
SELECT `items`.* FROM `items` INNER JOIN `grabs` ON `items`.id = `grabs`.item_id WHERE ((`grabs`.user_id = 1))

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `invitation_id`, `remember_token`, `last_name`, `login`, `email`, `invitation_limit`, `first_name`) VALUES('', 'bc9d6f65516606c03cccb802cbb942baf4bf8d3e', '2010-08-23 22:45:45', NULL, 'b5fac547bbd96c2d4406cd8ad28604481e186328', NULL, '2010-08-23 22:45:45', '32af3d4eb9ca9d2f90d5167a3bde84efac25e97f', NULL, NULL, 'Miner', 'wilson', 'kyledoherty@live.com', 5, 'Wilson')

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = '04bdaeefe201764f34295a7ddbe869b0d6fa703d') LIMIT 1

  def following
    @title = "Following"
    @user = User.find_by_login(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`login` = 'ian') LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find_by_login(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`login` = 'kyle') LIMIT 1

  def grabs
    @title = "Grabs"
    @user = User.find_by_login(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`login` = 'kyle') LIMIT 1